{
  "posts": [
    {
      "id": "1",
      "slug": "weekend-with-david",
      "title": "Weekend with David",
      "body": "Dear Diary,\n\nI should have known the weekend would unravel the moment David said, 'Trust me.' \n\nFirst of all, who says that with a smirk and sunglasses *indoors*? I was already on edge. But we went to the beach, and it was... perfect. He carried my tote bag like a gentleman (or a man with something to hide), and we had ice cream—his choice: pistachio. A choice I respected... until I saw him offer a spoonful to **ALEX**.\n\nYes, *Alex with the cheekbones*. Alex, my coworker. Alex who said they weren’t even 'into David like that.' Lies, Diary. Sweet, pistachio-flavored lies.\n\nLater that night, David said it was all 'harmless' and that Alex was 'just being friendly.' But then I found a *selfie* of the two of them on MY phone. They used MY camera roll for their little moment. \n\nI didn’t cry. Not in front of them. I just stared dramatically out the window like a soap opera protagonist and whispered, 'I trusted you with my tote bag.'\n\nI don't know where David and I stand now. But one thing is clear, Diary: I need to start setting boundaries... and hiding my phone."
    },
    {
      "id": "2",
      "slug": "the-espresso-incident",
      "title": "The Espresso Incident",
      "body": "Dear Diary,\n\nNever underestimate the power of caffeine and jealousy.\n\nI went to Café Flor with Julian. It was supposed to be a casual meet-up. Just two friends. Two *beautiful* friends with amazing chemistry and an unspoken spark. I wore my good earrings—the ones that say, 'I might break your heart, but you'll thank me for it.'\n\nWe ordered espresso. Double shots. Double trouble. Julian complimented my nail polish and then—**then**—leaned across the table and said, 'You always smell like citrus and secrets.'\n\nIt was going perfectly.\n\nUntil... in walks **Renata**.\n\nYes, *that* Renata. The barista with the tragic poetry blog and a vendetta against me ever since the Game Night Incident of ‘23.\n\nShe *winked* at Julian. Winked. I saw it. He CLAIMED it was just a twitch, but I wasn’t born yesterday, Diary.\n\nBy the time the espresso kicked in, I had plotted 3 revenge scenarios, none of them legal, and Julian was nervously stirring his drink like it was a potion that might get him out of this awkward triangle.\n\nWe ended the night with a hug that lingered. Julian said, 'Let’s not let anyone ruin our energy.'\n\nBut Diary, the energy has been tainted. And so has my caffeine tolerance."
    },
    {
      "id": "3",
      "slug": "texts-from-anthony",
      "title": "Texts from Anthony",
      "body": "Dear Diary,\n\nWhy do I always fall for people who use *ellipses* in texts? It’s the most dramatic punctuation mark. And Anthony? He practically *lives* in ellipses.\n\nSo when I got a message at 2:03 a.m. that just said, 'We need to talk…', I knew I wasn’t sleeping that night.\n\nI wore all black the next morning, just in case it was a breakup. (Or a funeral for my dignity.) We met at the park—the *rose garden*, no less. I brought a latte. He brought… tears.\n\nHe said he wasn’t sure if he could be 'the person I deserved.' \n\nWhat does that even mean, Diary?! That’s not a confession, it’s a riddle wrapped in a cliché.\n\nAnd just when I was about to say something devastatingly poetic like, 'Then be someone better,' his phone buzzed. \n\nIt was a text. From someone saved in his contacts as '❤️ Mystery ❤️'.\n\nI didn’t ask. I just stood up, flipped my scarf like I was in a slow-motion perfume commercial, and walked away. My latte untouched. My heart? Slightly bruised. My scarf? Iconic.\n\nTo be continued…"
    }
  ],
  "users": [
    {
      "id": "8c6d",
      "email": "nafziger10@gmail.com",
      "password": "jdnaf",
      "name": "JD"
    },
    {
      "id": "c292",
      "email": "alex@gmail.com",
      "password": "alex",
      "name": "Alex"
    },
    {
      "id": "53fb",
      "email": "a@a",
      "password": "a",
      "name": "\"A\""
    }
  ],
  "comments": [
    {
      "id": "1",
      "slug": "weekend-with-david",
      "content": "David offering pistachio to Alex?! Betrayal never tasted so sweet. Justice for the tote bag!",
      "timestamp": "2025-06-26T10:32:00Z",
      "userId": "3"
    },
    {
      "id": "2",
      "slug": "weekend-with-david",
      "content": "The selfie on YOUR phone? That’s villain origin story material.",
      "timestamp": "2025-06-26T10:33:00Z",
      "userId": "ae34"
    },
    {
      "id": "3",
      "slug": "the-espresso-incident",
      "content": "Julian saying you smell like citrus and secrets? That line belongs in a romance novel.",
      "timestamp": "2025-06-26T10:34:00Z",
      "userId": "ae34"
    },
    {
      "id": "4",
      "slug": "the-espresso-incident",
      "content": "Renata showing up mid-spark? Caffeine wasn’t the only thing brewing at Café Flor.",
      "timestamp": "2025-06-26T10:35:00Z",
      "userId": "ae34"
    },
    {
      "id": "5",
      "slug": "texts-from-anthony",
      "content": "Ellipses at 2 a.m.? That’s not texting, that’s emotional terrorism.",
      "timestamp": "2025-06-26T10:36:00Z",
      "userId": "ae34"
    },
    {
      "id": "6",
      "slug": "texts-from-anthony",
      "content": "That scarf flip? Cinematic. Anthony could never compete with that kind of exit.",
      "timestamp": "2025-06-26T10:37:00Z",
      "userId": "ae34"
    }
  ]
}